<a href="https://colab.research.google.com/github/gyujin0450/Rstudy/blob/master/202_%EB%8D%B0%EC%9D%B4%ED%84%B0%EA%B0%80%EA%B3%B5(1)_p35.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

데이터 가공

In [ ]:
# 성적데이터(sungjuk.rdata) 읽어오기
# 코랩에 파일을 드래그해서 올리고 실습함

In [1]:
load('sungjuk.rdata') # R 전용 데이터 읽어옴
sungjuk

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [3]:
# 총점과 평균을 계산하여 tot, avg 라는 컬럼 생성(방법1)
sungjuk$tot <- sungjuk$eng + sungjuk$mat + sungjuk$sci
sungjuk$avg <- sungjuk$tot / 3
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667

In [4]:
# 총점과 평균을 계산하여 tot, avg 라는 컬럼 생성(방법2)
sungjuk <- within(sungjuk, {
              tot <- eng + mat + sci
              avg <- tot / 3
           })
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667

In [5]:
# 정렬 : order(컬럼명,...)
# 성적데이터를 평균을 기준으로 정렬
order(sungjuk$avg)  #  각 데이터별 정렬 순번 출력

[1] 3 4 1 2

In [6]:
rn <- order(sungjuk$avg) # 오름차순
sungjuk[rn,]

  name eng mat sci tot avg
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333

In [7]:
rn <- order(-sungjuk$avg) # 내림차순
sungjuk[rn,]

  name eng mat sci tot avg
2 Tom  95  96  80  271 90.33333
1 John 90  85  90  265 88.33333
4 Jane 78  95  60  233 77.66667
3 Mark 69  49  70  188 62.66667

In [8]:
# 성적 데이터에 반(클래스) 변수 추가
sungjuk$class <-c(1,2,1,2)
sungjuk

  name eng mat sci tot avg      class
1 John 90  85  90  265 88.33333 1
2 Tom  95  96  80  271 90.33333 2
3 Mark 69  49  70  188 62.66667 1
4 Jane 78  95  60  233 77.66667 2

In [11]:
# 클래스별 최고/최저  영어 점수
# aggregate(대상, 그룹조건, 집계합수)
aggregate(sungjuk$eng, by=list(sungjuk$class),FUN=max)
aggregate(sungjuk$eng, by=list(sungjuk$class),FUN=min)

  Group.1 x
1 1       90
2 2       95

  Group.1 x
1 1       69
2 2       78

In [12]:
# 클래스별 평균 영어/수학/과학 점수?
aggregate(sungjuk, by=list(sungjuk$class),FUN=mean)

Warning message in mean.default(X[[i]], ...):
“argument is not numeric or logical: returning NA”
Warning message in mean.default(X[[i]], ...):
“argument is not numeric or logical: returning NA”

  Group.1 name eng  mat  sci tot   avg  class
1 1       NA   79.5 67.0 80  226.5 75.5 1
2 2       NA   86.5 95.5 70  252.0 84.0 2

In [16]:
# 특정 [행,렬] 가져오기
aggregate(sungjuk[,2:6], by=list(sungjuk$class),FUN=mean)

  Group.1 eng  mat  sci tot   avg
1 1       79.5 67.0 80  226.5 75.5
2 2       86.5 95.5 70  252.0 84.0

In [17]:
# 연습하기
# mtcars 데이터셋을 이용해서
# 실린더 cy1 컬럼을 기준으로 평균/최대/최소 연비 mpg는?
?mtcars

In [18]:
str(mtcars)

'data.frame':	32 obs. of  11 variables:
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : num  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : num  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : num  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : num  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: num  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: num  4 4 1 1 2 1 4 2 2 4 ...

In [19]:
head(mtcars, 5)

                  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2

In [27]:
aggregate(mtcars[,1],by=list(mtcars$cyl), FUN=mean)
aggregate(mtcars[,1],by=list(mtcars$cyl), FUN=max)
aggregate(mtcars[,1],by=list(mtcars$cyl), FUN=min)

  Group.1 x
1 4       26.66364
2 6       19.74286
3 8       15.10000

  Group.1 x
1 4       33.9
2 6       21.4
3 8       19.2

  Group.1 x
1 4       21.4
2 6       17.8
3 8       10.4